In [1]:
import pandas as pd
import matplotlib.pyplot as plt


%matplotlib inline

In [2]:
#import NDC deliveries csv
county_stats = pd.read_csv('../files/county_stats.csv')
county_stats.head()

,County,Total Population,Population Age 0-4,Population Age 5-9,Population Age 0-9,# Households,# Live Births,Est # in Diapers,Est. TennCare,Household Income (Avg),% Title 1 Schools,% Food Stamp,% Poverty Rate 0-17,% Poverty Rate All Ages,Pop in Poverty <17,Pop in Poverty Tot,In Diapers in Poverty,diapers used,Diaper cost/month,$ per county/month for low income
0,Davidson,"667,885","46,539","41,537","88,076","269,078","9,962","24,905","12,453","$60,388",63.42%,14.60%,25.40%,15.40%,169643,102854,6325.870,1518208.80,$70.00,"$442,810.90"
1,Williamson,"205,645","12,451","16,755","29,206","71,043","2,321","5,803","2,901","$112,962",17.74%,3.40%,3.50%,3.80%,7198,7815,203.105,48745.20,$70.00,"$14,217.35"
2,Montgomery,"189,709","16,476","14,404","30,880","67,090","3,512","8,780","4,390","$57,541",61.70%,13.20%,16.60%,12.00%,31492,22765,1457.480,349795.20,$70.00,"$102,023.60"
3,Maury,"85,767","5,730","6,077","11,807","32,889","1,184","2,960","1,480","$57,170",64.20%,16.40%,15.20%,10.80%,13037,9263,449.920,107980.80,$70.00,"$31,494.40"
4,Hickman,"24,251","1,291","1,553","2,844","8,855",257,643,321,"$43,596",88.89%,22.70%,24.20%,16.30%,5869,3953,155.606,37345.44,$70.00,"$10,892.42"

In [3]:
#only keep needed columns
county_stats = county_stats[['County',
                             'Est # in Diapers',
                             'Est. TennCare',
                             'Pop in Poverty Tot',
                             'Pop in Poverty <17',
                             'diapers used',
                             'Diaper cost/month',
                             '$ per county/month for low income'
                            ]].copy()
county_stats.head()

,County,Est # in Diapers,Est. TennCare,Pop in Poverty Tot,Pop in Poverty <17,diapers used,Diaper cost/month,$ per county/month for low income
0,Davidson,"24,905","12,453",102854,169643,1518208.80,$70.00,"$442,810.90"
1,Williamson,"5,803","2,901",7815,7198,48745.20,$70.00,"$14,217.35"
2,Montgomery,"8,780","4,390",22765,31492,349795.20,$70.00,"$102,023.60"
3,Maury,"2,960","1,480",9263,13037,107980.80,$70.00,"$31,494.40"
4,Hickman,643,321,3953,5869,37345.44,$70.00,"$10,892.42"

In [4]:
#rename columns
county_stats = county_stats.rename(columns = {'County':'county',
                                              'Est # in Diapers':'in_diapers(est)',
                                              'Est. TennCare':'tenncare(est)',
                                              'Pop in Poverty Tot':'pop_in_poverty',
                                              'Pop in Poverty <17':'pop_in_poverty<17',
                                              'diapers used':'diapers_used',
                                              'Diaper cost/month':'diapers_$/month',
                                              '$ per county/month for low income':'diaper_cost/month_low_income',
                                             })
county_stats.columns

Index(['county', 'in_diapers(est)', 'tenncare(est)', 'pop_in_poverty',
       'pop_in_poverty<17', 'diapers_used', 'diapers_$/month',
       'diaper_cost/month_low_income'],
      dtype='object')

In [5]:
#import NDC deliveries csv
total_by_county = pd.read_csv('../files/total_by_county.csv')
total_by_county.head()

           County    Total
0    Davidson, TN  1817313
1    Marshall, TN     2025
2       Maury, TN     1475
3  Washington, TN     3750
4  Williamson, TN     6050

In [6]:
#strip TN from counties and rename
total_by_county['County'] = total_by_county['County'].str.strip(', TN')
total_by_county = total_by_county.rename(columns = {'County':'county',
                                              'Total':'total'
                                             })
total_by_county

       county    total
0    Davidson  1817313
1    Marshall     2025
2       Maury     1475
3  Washington     3750
4  Williamson     6050
5      Wilson    10550

In [7]:
#merge datasets
diapers_by_county = pd.merge(county_stats, total_by_county, on = 'county', how = 'inner')
diapers_by_county

,county,in_diapers(est),tenncare(est),pop_in_poverty,pop_in_poverty<17,diapers_used,diapers_$/month,diaper_cost/month_low_income,total
0,Davidson,"24,905","12,453",102854,169643,1518208.8,$70.00,"$442,810.90",1817313
1,Williamson,"5,803","2,901",7815,7198,48745.2,$70.00,"$14,217.35",6050
2,Maury,"2,960","1,480",9263,13037,107980.8,$70.00,"$31,494.40",1475
3,Marshall,"1,025",513,4418,6236,48954.0,$70.00,"$14,278.25",2025
4,Wilson,"4,128",2064,9798,12436,98069.4,$70.00,"$28,603.58",10550